Revit 2024 API
TemperatureRatingType.CorrectionFactors Property
 Get all correction factors defined in this temperature rating type and its corresponding material type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CorrectionFactorSet CorrectionFactors { get; }
Visual Basic
Public ReadOnly Property CorrectionFactors As CorrectionFactorSet
	Get
Visual C++
public:
property CorrectionFactorSet^ CorrectionFactors {
	CorrectionFactorSet^ get ();
}
See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace